let height = 6; //брой опити
let width = 5; //дължина на думата

let row = 0; //текущ опит (номер на ред)
let col = 0; //текуща буква за този опит

let gameOver = false;
let wordList = ["абака", "абдал", "айрян", "абзац", "аборт", "аванс", "авари", "авеню", "аверс", "авизо", "авоар", "аврен", "автор", "айтос", "акага", "акана", "акант", "акари", "акита", "акорд", "акран", "аксон", "актив", "акула", "акура", "акциз", "акция", "аланд", "албит", "албум", "алгол", "алгор", "алеко", "алена", "алепу", "алжир", "алиби", "алино", "алиса", "алкал", "алкид", "аллах", "алмус", "алтай", "алтея", "алтън", "алцек", "амати", "амвон", "амеба", "амига", "амиен", "ампер", "ампир", "амрок", "анали", "ананд", "анато", "ангел", "ангро", "ангъч", "анекс", "ането", "анион", "анкер", "анонс", "антик", "антре", "анфас", "анцуг", "аншоа", "аншуа", "аорта", "аплет", "аплик", "апорт", "април", "араби", "арапи", "арган", "аргат", "аргон", "аргос", "аргун", "арден", "ареал", "арека", "арена", "арест", "ариел", "ариец", "армея", "армия", "арома", "арсен", "артур", "аруба", "архив", "арчар", "аршин", "асана", "аскер", "аскет", "аслан", "аспис", "аспра", "астма", "астор", "астра", "асуан", "атака", "атари", "аташе", "атика", "атила", "атина", "атлаз", "атлас", "атлет", "атлон", "аудио", "аурис", "афган", "афект", "афера", "афикс", "афлек", "ахмак", "ахчия", "ашока", "ашрам", "ашуре", "аязмо", "бабек", "бабка", "бабяк", "багаж", "багер", "багра", "бадем", "баден", "баджа", "баене", "базар", "базел", "базис", "бакау", "бакии", "бакия", "бакла", "бакър", "балет", "балон", "балто", "балша", "балък", "банан", "банат", "банги", "банда", "банер", "банка", "банкя", "банту", "банши", "банян", "бараж", "барел", "баржа", "барий", "барит", "барок", "барон", "барут", "барче", "басет", "баски", "басма", "басня", "басра", "баста", "батак", "батат", "батик", "батил", "батко", "батут", "бафта", "бахар", "бахия", "бахур", "бацил", "бдене", "бегач", "бедро", "безир", "бейра", "бекар", "бекас", "бекон", "бекяр", "белги", "белег", "белем", "белиз", "белиш", "белка", "белот", "бемол", "бенин", "бенка", "берат", "берач", "берик", "берил", "берое", "бетон", "бибан", "бивак", "бивни", "бивол", "бигор", "бигъл", "бидон", "биела", "бизон", "билет", "билка", "билла", "бинго", "бином", "бирма", "бисау", "бисер", "битие", "битка", "битум", "бичме", "благо", "блато", "блейк", "блуза", "блюдо", "бобър", "бодеж", "бодил", "божак", "божур", "боинг", "бойга", "бокал", "болдо", "болид", "болка", "бомба", "бомбе", "бонус", "борат", "борба", "бордо", "борей", "борец", "борий", "борил", "борис", "борса", "борът", "ботев", "ботуш", "бофор", "бохем", "бохот", "бохум", "бохча", "брава", "браво", "браги", "брада", "брайл", "брама", "брана", "бране", "бранш", "браун", "бреда", "бреза", "брейн", "бреме", "брест", "бридж", "бронз", "броня", "брояч", "бруст", "бруто", "брюле", "бряст", "бубал", "бубка", "будка", "букаи", "букак", "буква", "букет", "букла", "букса", "булдо", "булка", "бумка", "бунар", "буная", "бурен", "бурка", "бурма", "бутан", "бутик", "бутон", "буфер", "бухал", "бухта", "бухти", "бушел", "бушон", "бъзак", "бълха", "бърда", "бърдо", "бърля", "бърна", "бърне", "бърно", "бътън", "бъчва", "бюрек", "бягай", "бялка", "вагон", "вагус", "вадуц", "вазов", "вакса", "валеж", "валия", "валмо", "валяк", "ванео", "варан", "варел", "варна", "варта", "варус", "васал", "вафла", "вахта", "вбури", "вебер", "ведро", "веене", "вежда", "везба", "везер", "везир", "везна", "везни", "вейка", "векът", "велес", "велур", "венга", "венге", "венда", "венец", "венто", "венче", "вепър", "верди", "верев", "верея", "версо", "верую", "весло", "веста", "вечер", "вешин", "взвод", "взлом", "взрив", "видал", "видар", "видео", "видин", "видра", "виена", "виене", "визон", "викач", "викът", "вилка", "винар", "винех", "винил", "винка", "винче", "виола", "вираж", "вирус", "висла", "висше", "вития", "витло", "вихър", "вишан", "вишна", "вишну", "влага", "власт", "внуци", "водач", "воден", "водещ", "водка", "война", "вокал", "вокил", "волан", "волво", "волга", "волев", "волен", "волно", "волов", "волос", "волоф", "волта", "вопъл", "восък", "впряг", "врана", "враня", "врата", "врати", "враца", "вреда", "врене", "врява", "вуйчо", "вчера", "въжар", "възел", "върба", "въшка", "вятър", "габер", "габон", "габра", "габър", "гавот", "гавра", "гагат", "гайда", "гайка", "галац", "галий", "галия", "галон", "галоп", "ганди", "гараж", "гараш", "гарга", "гатер", "гауди", "гаяна", "гейша", "гекон", "гемия", "гений", "геном", "генуа", "генчо", "геоид", "герак", "герен", "герой", "гибон", "гидия", "гилза", "гимел", "гинес", "гинко", "гинци", "глава", "гланц", "глина", "глист", "глоба", "гнайс", "гнида", "гоген", "гогол", "годеж", "годеч", "годжи", "гозба", "голак", "голеш", "гомел", "гомор", "гонзо", "гонче", "горец", "горки", "горун", "граал", "грами", "гранд", "грапа", "графа", "греда", "грива", "гризу", "грозд", "грюер", "гуава", "гуано", "губер", "губеш", "гугла", "гугул", "гугъл", "гуиро", "гулаг", "гулар", "гулия", "гуляй", "гунди", "гупта", "гурде", "гурме", "гусла", "гуцал", "гущер", "гъдел", "гълъб", "гъмза", "гърло", "гърне", "гърня", "гъска", "гьоте", "гювеч", "гюрук", "давид", "дажба", "дайре", "дакар", "дакел", "дакия", "далай", "далак", "далас", "далет", "далеч", "далия", "далян", "даман", "дания", "данон", "данте", "данък", "дарак", "дарба", "дарби", "дахау", "дачия", "двина", "дебит", "дебри", "девер", "девиз", "девин", "девня", "девон", "девън", "дедал", "дейзи", "дейли", "декан", "декар", "декор", "делба", "делва", "делко", "делон", "делта", "делфи", "делхи", "делян", "демон", "демос", "денар", "денга", "денеб", "деним", "десен", "дефис", "дешат", "джава", "джани", "джаул", "джейн", "джери", "джинс", "джиро", "джото", "джудо", "джуно", "дзифт", "дзука", "диана", "дивак", "диван", "дивеч", "дивна", "диема", "диета", "дижон", "дизел", "дилаф", "дилов", "дилър", "димят", "динар", "динго", "диоди", "диона", "дипла", "диско", "длето", "добра", "добуш", "довод", "дойка", "долап", "долар", "домат", "донец", "донор", "донос", "допир", "досие", "доход", "драва", "драйв", "драка", "дрина", "дрозд", "дроид", "дропс", "друзи", "друид", "дуала", "дубай", "дузпа", "дунав", "дупка", "дурча", "душка", "дъбен", "дъдли", "дънер", "дънки", "дънст", "дърво", "дъска", "дюбел", "дювал", "дюшек", "дявол", "дякон", "ебола", "евбея", "евита", "евреи", "евънс", "ездач", "езеро", "ейвън", "ейпъл", "еклер", "екран", "елада", "елаюн", "елена", "елзас", "елиза", "елмаз", "емайл", "емине", "емона", "енево", "енина", "енфие", "енчец", "епика", "епоха", "епсъм", "ерато", "ербий", "ерген", "ерден", "ерзац", "ерида", "еркер", "ерньо", "ерука", "есекс", "ескиз", "еспас", "етика", "етнос", "етъра", "ефате", "ефект", "ефрат", "ефрон", "жажда", "жакет", "жалба", "жезъл", "желен", "желъд", "жених", "жерав", "жетон", "живак", "жилет", "жираф", "житан", "жител", "житен", "житие", "жлеза", "жуанг", "жудец", "жужуй", "жътва", "завет", "завод", "завой", "зайци", "закон", "залеж", "залез", "залив", "залог", "залък", "замах", "замбо", "замия", "замък", "заник", "запад", "запас", "запек", "запис", "запор", "заряд", "захар", "захир", "звено", "здрач", "зебра", "зелка", "земен", "зенит", "зенон", "зефир", "зидар", "злато", "злоба", "злота", "змияр", "знаме", "зокум", "зомби", "зубър", "зълва", "зърно", "ибиса", "иблис", "ибсен", "ивана", "ивеко", "иврит", "идеал", "идели", "идиом", "идиот", "избор", "извод", "извор", "изида", "изкоп", "излет", "измир", "износ", "изпит", "израз", "изток", "изход", "ийтън", "икона", "илиев", "илипе", "имаго", "имидж", "имола", "инана", "индже", "индий", "индия", "индра", "индус", "интел", "интер", "ираде", "ирида", "ирина", "иртиш", "исиот", "искра", "искър", "ислям", "исузу", "итака", "итрий", "ичера", "ишиас", "йемен", "кабел", "кабул", "кавал", "кавга", "кавча", "кавър", "кадем", "кадет", "кадис", "кадър", "казак", "казан", "казус", "кайен", "кайма", "кайра", "кайро", "какао", "какус", "калай", "калий", "калки", "калос", "калъп", "калъф", "камаз", "камба", "камен", "камея", "камък", "камъш", "канал", "канап", "кания", "канна", "канон", "канта", "канче", "каняк", "капак", "капан", "капия", "капка", "капла", "капри", "карат", "карго", "карма", "карта", "касис", "касия", "каско", "каста", "катал", "катар", "катер", "катет", "катма", "катод", "катък", "кауза", "кафез", "кафка", "каффе", "кахон", "кашон", "каюта", "квант", "кварк", "кварц", "квота", "кегла", "кегли", "кедър", "кейси", "келти", "кенга", "кения", "кесия", "кефал", "кечуа", "киану", "кикот", "килер", "килим", "килия", "кимчи", "кинкс", "киноа", "киора", "киото", "кипър", "кирка", "киста", "китай", "китка", "кифла", "кихот", "кичур", "клада", "клайд", "клапа", "кларк", "клещи", "клинч", "клише", "клоун", "клоше", "клюка", "кнежа", "кнехт", "книга", "коала", "кобдо", "кобол", "кобра", "кобур", "ковач", "кодак", "коелю", "кожух", "козел", "коило", "кокал", "кокер", "кокоз", "кокос", "колаж", "колан", "колар", "колба", "колеж", "колет", "колие", "колит", "колов", "колон", "колос", "комар", "комби", "комбо", "комик", "комин", "комит", "комод", "конан", "конга", "конго", "конец", "коноп", "конте", "конус", "коняк", "копие", "копой", "копра", "копче", "копър", "кораб", "корал", "коран", "корда", "корем", "корен", "корея", "кория", "корса", "корфу", "косъм", "котва", "котел", "котка", "котки", "кохин", "кохош", "кочан", "кошер", "кошче", "краал", "крава", "креда", "крейг", "крива", "криза", "крило", "крона", "крояч", "круша", "кръст", "ксара", "куача", "кубан", "кубер", "куджо", "кудзу", "куийн", "куинс", "кукла", "кукуи", "кулак", "кулон", "купен", "купол", "купон", "кураж", "курус", "куско", "кутия", "куфар", "кухня", "куяба", "кхоза", "кхуми", "кълбо", "кънка", "кънки", "кърма", "кърпа", "кьолн", "кюнец", "кюрий", "кюспе", "кюфте", "лавка", "лавра", "лаври", "лавър", "лагер", "лагос", "лазур", "лайка", "лакей", "лакът", "ламар", "ламед", "лампа", "лампи", "ландо", "ланос", "ланча", "лапад", "лапас", "лапил", "ларва", "ларея", "ласка", "ласко", "лауда", "лафет", "лахор", "лацио", "лебед", "левга", "легат", "леген", "легия", "легло", "лекар", "ленин", "ленко", "лента", "леоне", "лепка", "лепра", "лепта", "леска", "летец", "лефер", "лиана", "либия", "либра", "ливан", "лигър", "лийдс", "ликра", "лилия", "лиляч", "лиман", "лимец", "лимит", "лимож", "лимон", "лимфа", "линеа", "линия", "линус", "липса", "лиска", "литак", "литва", "литий", "литър", "лихва", "лицей", "лиций", "лишей", "лоара", "лоаре", "ловец", "ловеч", "логан", "логик", "логос", "лодка", "лозен", "лозно", "локал", "локва", "локум", "ломец", "лопен", "лопуш", "лопян", "лоран", "лорен", "лотос", "лотус", "лувър", "лукчо", "лумен", "лусон", "лутън", "лъжец", "любаш", "любов", "люлин", "люлка", "люляк", "люспа", "лютня", "маври", "мавър", "маган", "магер", "магия", "магма", "магот", "мадан", "мажор", "мазда", "мазол", "мазут", "майка", "майор", "макак", "макао", "малта", "мамба", "мамбо", "мамут", "манат", "манго", "манеж", "маноя", "манто", "маори", "мареа", "марек", "мария", "марка", "марке", "маркс", "марля", "марсо", "масаж", "масаи", "маска", "масло", "масон", "матка", "мафия", "мачта", "мащаб", "маями", "мбира", "мебел", "меган", "мегре", "медал", "медик", "медия", "мезек", "мейот", "мекиш", "мелба", "мелия", "менза", "мента", "менте", "мерло", "месар", "месец", "месия", "места", "метал", "метан", "метеж", "метил", "метис", "метла", "метод", "метох", "метро", "метър", "мехур", "мечит", "мечка", "мечки", "мивка", "мигла", "мигли", "мидия", "мизия", "милан", "милет", "милим", "мимас", "мимир", "миндя", "минор", "минос", "минск", "минус", "мирис", "мирта", "мисия", "мисъл", "мицел", "мишка", "мливо", "мляко", "модел", "модул", "мозел", "мозир", "мозък", "мойри", "мокет", "мокош", "молар", "молба", "молец", "молив", "молох", "момче", "момък", "монах", "монго", "монои", "моном", "монро", "монте", "монца", "морал", "морач", "моряк", "мосул", "мотел", "мотив", "мотор", "мочур", "мрава", "мрежа", "мряна", "музга", "мулан", "мулат", "мулга", "мумия", "мурад", "мурга", "мусон", "мухъл", "мълва", "мъфин", "мюлуз", "мярка", "място", "мятва", "набор", "набук", "навес", "навик", "нагон", "нагоя", "надир", "найра", "накит", "накфа", "налеп", "налог", "намек", "намиб", "намюр", "нанси", "напев", "напор", "нарез", "народ", "нарта", "наръч", "насау", "насип", "натал", "наука", "науру", "нафта", "нахут", "нация", "начин", "наяди", "невен", "негев", "негър", "недъг", "неман", "немец", "непал", "нерва", "нерез", "нерон", "несла", "нигер", "никаб", "никел", "никой", "нимфа", "нирец", "нисан", "нитро", "ницше", "нишка", "нобел", "новел", "нокия", "нокти", "нокът", "номер", "нонет", "норма", "носач", "носия", "носов", "нощта", "нубия", "нужда", "нушич", "ньорд", "нюанс", "нюарк", "нютон", "оазис", "обект", "обеца", "обзор", "обида", "обиск", "обица", "облак", "облик", "облог", "обмен", "образ", "обрат", "обред", "обрив", "обръч", "обсег", "обява", "оверн", "овчар", "оглед", "огняр", "одеса", "ойлер", "океан", "окови", "окорс", "окото", "окръг", "оксид", "октет", "оланд", "олива", "олимп", "олово", "олтар", "омара", "омаяк", "омега", "омлет", "онгъл", "оникс", "опака", "опело", "опера", "опиум", "опора", "опция", "орган", "орден", "ордер", "ордос", "ореол", "ориби", "орикс", "орион", "орляк", "оромо", "оруел", "орфей", "осака", "осика", "оскар", "осмий", "особа", "осояд", "остен", "остин", "отава", "отбив", "отбор", "отвор", "отдих", "отело", "отзив", "отказ", "откат", "откос", "откуп", "откъс", "отлив", "отпор", "отчет", "оугия", "офика", "офорт", "охайо", "охики", "охлюв", "охрид", "очерк", "очила", "очуша", "рабат", "равда", "равна", "радар", "раджа", "радий", "радио", "радон", "разум", "райна", "район", "ракия", "ралин", "раман", "рамбо", "рамия", "рамка", "рампа", "ранко", "рапас", "рапел", "рапид", "рапър", "ратай", "рахит", "ребро", "ребус", "ревен", "ревер", "режим", "резба", "резен", "резил", "реймс", "рекет", "релеф", "релса", "ренде", "рений", "ренин", "рента", "репей", "репин", "ресен", "ресор", "ресто", "рефер", "риана", "рибар", "рибен", "риган", "ригел", "ридик", "рийвс", "рикша", "рилци", "риман", "ринит", "ритон", "ритъм", "рицар", "рицин", "ровър", "рогош", "родий", "родос", "рожен", "рокет", "рокля", "роман", "ромео", "ромул", "ронин", "ропот", "росен", "ротор", "рубик", "рубин", "рубла", "румба", "рупия", "рупци", "русия", "русло", "ручей", "ръжда", "ръкав", "ръсел", "сабал", "сабин", "сабур", "савак", "саван", "савоа", "савоя", "саган", "сажда", "сайда", "сакар", "саксо", "салам", "салдо", "салем", "салеп", "салон", "салса", "салто", "салца", "салют", "самар", "самба", "самбо", "самех", "самец", "самоа", "самос", "самун", "самур", "санго", "сапун", "сарай", "сараф", "сарач", "сарма", "сатен", "сатир", "сатър", "сауна", "сачма", "сбруя", "свада", "свако", "свила", "свиня", "свита", "своге", "свяст", "сгода", "сеанс", "севар", "севда", "север", "седан", "седем", "седеф", "седло", "седра", "сезан", "сезар", "сезон", "сейко", "секам", "секач", "секта", "селда", "селен", "селим", "селфи", "семит", "семка", "сенат", "сенит", "сенки", "сента", "сепия", "серия", "серум", "сесия", "сетер", "сетре", "сефте", "сибир", "сивен", "сивик", "сигла", "сигма", "сидни", "сизиф", "силва", "силоз", "силур", "симид", "синай", "синап", "синка", "синод", "синор", "синус", "сипей", "сирак", "сирия", "сироп", "сисле", "сифон", "скала", "скалп", "скара", "скаут", "скеле", "скиор", "скити", "скица", "склад", "склон", "скоба", "скрап", "скреж", "скреч", "скрин", "скръб", "скудо", "скука", "скула", "скуош", "слава", "слайд", "слама", "слана", "сласт", "следа", "слива", "слова", "слово", "слуга", "слука", "слюда", "смарт", "смерч", "сминд", "смола", "смрад", "смърт", "смърч", "смяна", "снага", "снаха", "соаре", "содом", "сойка", "сокак", "сокет", "сокол", "солун", "сонар", "сонда", "сонет", "сопол", "сопот", "сорго", "софия", "софра", "спенс", "спика", "спирт", "спица", "спици", "сплав", "спора", "спорт", "спреж", "спрей", "среда", "среща", "сряда", "става", "стадо", "стара", "старк", "старт", "ствол", "стела", "стена", "стенд", "стени", "стикс", "стилб", "стило", "стинг", "стоеж", "стоик", "стока", "стоун", "стоян", "страж", "страх", "стрес", "строй", "струг", "струя", "стръв", "стрък", "ступа", "стълб", "судан", "суета", "суинг", "сукно", "сулка", "сумка", "сурва", "сурдо", "сусам", "суфле", "сухар", "сфера", "схема", "сцена", "събор", "съвет", "съдба", "съдия", "сълза", "сънчо", "сърма", "сърна", "съсед", "съсел", "съчка", "съчма", "сюжет", "сюита", "сянка", "табак", "табан", "табла", "табло", "табор", "табун", "таван", "тагма", "тайга", "таймс", "тайна", "тайфа", "такса", "такси", "такъм", "талаз", "талаш", "талий", "талин", "талия", "талон", "талпа", "тамян", "танах", "танго", "танин", "тапет", "тапир", "тапия", "таран", "тарга", "тасос", "татра", "татри", "татул", "тафта", "тахан", "тегел", "тегло", "тезей", "тезис", "теист", "текст", "телец", "телиш", "телур", "теляк", "темел", "темза", "темпо", "тенге", "тенет", "тенис", "тения", "тенор", "тента", "тепих", "терен", "терор", "терца", "тесла", "тесте", "тесто", "тетра", "тетри", "тефра", "тешел", "тиара", "тибет", "тибия", "тибър", "тиган", "тигел", "тигър", "тиква", "тиксо", "тимиш", "тимок", "тимор", "тимус", "типец", "тираж", "тиран", "тирол", "титан", "титла", "титра", "титри", "тлака", "тобол", "товар", "токио", "токту", "томей", "тонаж", "тонга", "тонер", "тоник", "тонус", "тонфа", "топаз", "топка", "топор", "топуз", "топче", "торба", "торий", "торос", "торта", "тоска", "тотем", "точка", "тояга", "траки", "тракт", "транс", "трасе", "трата", "траур", "траян", "трева", "трела", "тренд", "трефа", "триак", "триас", "трико", "трина", "триод", "трион", "триор", "трици", "тромб", "троха", "троян", "трупа", "тръба", "тръст", "туден", "тукан", "тулий", "тулон", "тулси", "тулуп", "тумба", "тумор", "тунел", "тунис", "тупак", "тупая", "турия", "турло", "турне", "турта", "тутар", "тутси", "тухла", "тъжба", "тъкан", "тъкач", "тълпа", "тъпан", "тътен", "тюдор", "тюлен", "тютюн", "убиец", "угаин", "угода", "удине", "уенди", "узбек", "узура", "уилоу", "уиски", "уклей", "уклон", "улика", "улица", "умник", "умора", "унция", "уплах", "упрек", "урбан", "урвич", "урина", "уроки", "успех", "устав", "устна", "устои", "устра", "утеха", "уфици", "ухуру", "участ", "ушите", "фабия", "фагот", "фазан", "факел", "факир", "факла", "фалит", "фалос", "фанта", "феите", "фенер", "фенът", "ферма", "фиджи", "фикус", "филиз", "филип", "фоайе", "фобия", "фокус", "фолио", "форма", "форум", "фрапе", "фуния", "фураж", "фурия", "фурма", "фурна", "цвете", "цедка", "чавка", "чадър", "чайка", "чалга", "чанта", "чапла", "черга", "череп", "черта", "чесън", "четка", "чехли", "чешма", "число", "човек", "човка", "чубра", "чувал", "чуваш", "чудак", "чукче", "чучур", "шайба", "шапка", "шаран", "шарка", "шатра", "шахта", "шевка", "шейна", "шепот", "шериф", "шипка", "шипки", "ширит", "шифър", "шишко", "шишче", "шкода", "школо", "шнола", "шпага", "шрифт", "шумен", "шунка", "южняк", "юзина", "юмрук", "юнона", "юноша", "юрган", "юрист"];
let guessList = ["абака", "абзац", "авари", "азмак", "акита", "аксон", "акура", "амрок", "амеба", "автор", "бурна", "янтра", "ядене", "яблан", "юрист", "юряяя", "юзина", "ъглен", "ървин", "щерка", "чадър", "чакра", "чекия", "чехли", "човка", "чесън", "чехли", "четка", "чувал", "чучур", "цезар", "цифра", "цикъл", "хазна", "хаити", "хинди", "хинин", "хонда", "хорда", "хлапе", "хегел", "хидра", "хиена", "хинин", "фазан", "факир", "фенер", "фикус", "флора", "филия", "фураж", "убиец", "угода", "умора", "успех", "устав", "устна", "упрек", "уплах", "табак", "талия", "танго", "тения", "телец", "тиган", "товар", "топче", "трупа", "тюлен", "тълпа", "саган", "салют", "сачма", "свила", "седеф", "селен", "сигма", "скрап", "скреч", "скрин", "сколн", "слава", "следва", "слана", "снаха", "смърч", "сряда", "спрей", "спорт", "стадо", "стена", "стрес", "страх", "сцена", "съсел", "сърма", "релса", "ресто", "рубик", "рокля", "парфе", "певец", "пелин", "патур", "позор", "полен", "порок", "пожар", "помощ", "полюс", "пране", "проза", "пъзел", "оазис", "обеца", "овчар", "опиум", "опера", "очила", "набор", "немец", "начин", "недъг", "никой", "нимфа", "нитро", "нюанс", "мамут", "масло", "матка", "метла", "момче", "минус", "мъфин", "молив", "мъгла", "мотел", "легло", "леген", "лихва", "лишей", "люспа", "любов", "линия", "липса", "лувър", "ликра", "лепка", "лиана", "бетон","шупла","шхара","шхуна","шхуни","шпайк","шпора","шприц","шпула","шокър","шопар","шорти","шотки","шлака","шланг","шлейф","шквал","ширак","шибил","шибой","шивач","шиити","шикан","шинел","шиник","шерпа","шекел","шекер","шекли","шашка","шваба","шанел","шанца","шайка","шаман","шабла","шавар","шагал","чупла","чурек","чухал","чукар","чорба","чорул","чосър","чифте","чобан","чибук","чизми","чилик","чинар","чиния","чинка","чирак","чирен","чироз","чехов","части","часът","чатал","чатам","чачак","чебол","чебър","чекия","челси","чепик","чепка","чалма","чакал","чакра","цезар","цезий","целий","цента","церий","цесия","цефей","цигла","цикас","цикла","цикъл","циния","цирей","цирус","цисус","цитат","цитра","цифра","цицер","циция","цокъл","цонга","цюрих","фуста","фюлке","фюрер","фреза","фрейм","френи","фройд","фронт","фугас","фукус","фулъм","фосил","фотон","фраза","франк","форте","фонда","фолат","фобос","филия","филса","финал","финес","фиорд","фирма","фланг","флирт","флокс","флора","флуид","флуор","филер","фетел","фетиш","фетус","фиала","фибра","фидел","фарад","фарси","фарът","фасет","фасон","фасул","фауна","фаянс","федер","силаж", "агаве", "агаси", "агент", "агила", "агнец", "агого", "агора", "агути", "адамс", "адепт", "адлер", "адрес", "ажван", "ажгон", "азмак", "айвар", "аймак", "айова"];

guessList = guessList.concat(wordList);

let chosenWord  = wordList[Math.floor(Math.random() * wordList.length)].toUpperCase();
console.log(chosenWord);

window.onload = function () {
    intialize();
    document.addEventListener("keydown", (e) => {
        if (e.code === "Backspace") {
            if (col > 0) {
                col -= 1;
                let currTile = document.getElementById(row.toString() + '-' + col.toString());
                currTile.innerText = "";
            }
        }
    });
    document.addEventListener("keydown", (e) => {
        if (e.code === "Enter") {
            update();
        }
    });

}

function intialize() {
    // Създаване на дъската за игра
    for (let r = 0; r < height; r++) {
        for (let c = 0; c < width; c++) {
            let tile = document.createElement("span");
            tile.id = r.toString() + "-" + c.toString();
            tile.classList.add("tile");
            tile.innerText = "";
            document.getElementById("board").appendChild(tile);
        }
    }

    // Създаване на клавиатурата
    let keyboard = [
        ["Й", "Ц", "У", "К", "Е", "Н", "Г", "Ш", "Щ", "З"],
        ["Ф", "Х", "Ъ", "В", "А", "П", "Р", "О", "Л", "⌫"],
        ["Enter", "Я", "Ч", "С", "М", "И", "Т", "Ь", "Ю"]
    ];

    for (let i = 0; i < keyboard.length; i++) {
        let currRow = keyboard[i];
        let keyboardRow = document.createElement("div");
        keyboardRow.classList.add("keyboard-row");

        for (let j = 0; j < currRow.length; j++) {
            let keyTile = document.createElement("div");

            let key = currRow[j];
            keyTile.innerText = key;
            if (key === "Enter") {
                keyTile.id = "Enter";
                keyTile.addEventListener("click", processEnterKey);
            } else if (key === "⌫") {
                keyTile.id = "Backspace";
                keyTile.addEventListener("click", processBackspaceKey);
            } else if ("А" <= key && key <= "Я") {
                keyTile.id = "Key" + key;
                keyTile.addEventListener("click", processLetterKey);
            }

            if (key === "Enter") {
                keyTile.classList.add("enter-key-tile");
            } else {
                keyTile.classList.add("key-tile");
            }
            keyboardRow.appendChild(keyTile);
        }
        document.body.appendChild(keyboardRow);
    }

    // Слушане на натискане на клавиши
    document.addEventListener("keyup", (e) => {
        processInput(e);
    });

}


function processEnterKey() {
    update();
}

function processBackspaceKey() {
    if (col > 0) {
        col -= 1;
        let currTile = document.getElementById(row.toString() + '-' + col.toString());
        currTile.innerText = "";
    }
}

function processLetterKey() {
    let key = this.innerText.toUpperCase();
  
    if (/^[А-Я]$/.test(key)) {
      if (col < width) {
        let currTile = document.getElementById(row.toString() + '-' + col.toString());
        if (currTile.innerText == "") {
          currTile.innerText = key;
          col += 1;
        }
      }
    }
  }
  

// Replace the processKey function with an arrow function
function processKey(key) {
    e = { key: key };
    processInput(e);
}

function processInput(e) {
    if (gameOver) return;
  
    if ("key" in e) {
      let key = e.key.toUpperCase();
  
      if (/^[А-Я]$/.test(key)) {
        if (col < width) {
          let currTile = document.getElementById(row.toString() + "-" + col.toString());
          if (currTile.innerText == "") {
            currTile.innerText = key;
            col += 1;
          }
        }
      } else if (key === "Backspace") {
        if (col > 0) {
          col -= 1;
          let currTile = document.getElementById(row.toString() + "-" + col.toString());
          currTile.innerText = "";
        }
      } else if (key === "Enter") {
        update();
      }
    }
  
    if (!gameOver && row === height) {
      gameOver = true;
      document.getElementById("answer").innerText = chosenWord;
    }
  }
  
  
function update() {
    let guess = "";
    document.getElementById("answer").innerText = "";
  
    // Съставяне на думата от позициите
    for (let c = 0; c < width; c++) {
      let currTile = document.getElementById(row.toString() + '-' + c.toString());
      let letter = currTile.innerText;
      guess += letter;
    }
  
    guess = guess.toLowerCase();
    console.log(guess);
  
    if (!guessList.includes(guess)) {
      document.getElementById("answer").innerText = "Не е в списъка с думи";
      return;
    }
  
    // Обработване на позициите
    let correct = 0;
  
    let letterCount = {};
    for (let i = 0; i < chosenWord.length; i++) {
      let letter = chosenWord[i];
  
      if (letterCount[letter]) {
        letterCount[letter] += 1;
      } else {
        letterCount[letter] = 1;
      }
    }
  
    console.log(letterCount);
  
    for (let c = 0; c < width; c++) {
      let currTile = document.getElementById(row.toString() + '-' + c.toString());
      let letter = currTile.innerText;
  
      if (chosenWord[c] == letter) {
        currTile.classList.add("correct");
        currTile.classList.remove("present", "absent");
  
        let keyTile = document.getElementById("Key" + letter);
        if (keyTile) {
          keyTile.classList.remove("present", "absent");
          keyTile.classList.add("correct");
        }
  
        correct += 1;
        letterCount[letter] -= 1;
      } else if (chosenWord.includes(letter)) {
        currTile.classList.add("present");
        currTile.classList.remove("correct", "absent");
  
        let keyTile = document.getElementById("Key" + letter);
        if (keyTile) {
          keyTile.classList.remove("correct", "absent");
          keyTile.classList.add("present");
        }
      } else {
        currTile.classList.add("absent");
        currTile.classList.remove("correct", "present");
      }
  
      if (correct == width) {
        gameOver = true;
      }
    }
  
    console.log(letterCount);
  
    row += 1;
    col = 0;
  }
  